Repository: marmind/IdentityServer3.Contrib.Localization.UI
Catalog: source/IdentityServer3.Contrib.Localization.UI/Resources/*.po
Languages: ar, de

# common.error
source: Error
ar: حدث خطأ
de: Fehler

# login.username
source: Username
ar: اسم المستخدم
de: Benutzername

# login.username.placeholder
source: Username
ar: اسم المستخدم
de: Benutzername

# login.password
source: Password
ar: كلمة المرور
de: Passwort

# login.password.placeholder
source: Password
ar: كلمة المرور
de: Passwort

# login.rememberLogin
source: Remember My Login
ar: الإبقاء على تسجيل الدخول
de: Angemeldet bleiben

# login.local
source: Local Login
ar: تسجيل الدخول بحساب داخلي
de: Lokale Anmeldung

# login.title
source: Login
ar: تسجيل الدخول
de: Anmeldung

# login.action
source: Login
ar: تسجيل الدخول
de: Anmelden

# login.external
source: External Login
ar: تسجيل الدخول بحساب خارجي
de: Externe Anmeldung

# login.different
source: Login With Different Account
ar: تسجيل الدخول بحساب آخر
de: Mit anderem Konto anmelden

# logout.title
source: Logout
ar: تسجيل الخروج
de: Abmeldung

# logout.info
source: You are now logged out
ar: تم تسجيل خروجك
de: Sie wurden abgemeldet.

# logout.click
source: Click
ar: إضغط
de: Klicken Sie

# logout.here
source: here
ar: هنا
de: hier

# logout.return
source: to return to the
ar: للرجوع إلى
de: um zu

# logout.application
source: application
ar: التطبيق
de: zurückzukehren.

# logout.from
source: Would you like to logout of
ar: هل تريد تسجيل الخروج من
de: Möchten Sie sich von

# logout.yes
source: Yes
ar: نعم
de: Ja

# consent.request
source: is requesting your permission
ar: يطلب التصريح منك
de: fragt um Ihre Erlaubnis an

# consent.uncheck
source: Uncheck the permissions you do not wish to grant.
ar: قم بإلغاء اختيار الصلاحيات التي لا تريد منحها
de: Wählen Sie die Berechtigungen ab, die Sie nicht erteilen möchten.

# consent.personalInformation
source: Personal Information
ar: البيانات الشخصية
de: Persönliche Informationen

# consent.applicationAccess
source: Application Access
ar: الوصول للتطبيق
de: Anwendungszugriff

# consent.required
source: (required)
ar: (مطلوب)
de: (erforderlich)

# consent.rememberDecision
source: Remember My Decision
ar: قم بتذكر قراري
de: Meine Entscheidung merken

# consent.allow
source: Yes, Allow
ar: نعم، قم بإعطاء التصريح
de: Ja, erlauben

# consent.disallow
source: No, Do Not Allow
ar: لا تُصَرِّح
de: Nein, nicht erlauben

# permissions.client
source: Client Application Permissions
ar: تصاريح التطبيق
de: Berechtigung für Client-Anwendung

# permissions.nonGranted
source: You have not given permission to any applications
ar: لم تقم بإعطاء أي من التصاريح للتطبيق
de: Sie haben noch keiner Anwendung Berechtigungen erteilt

# permissions.identity
source: Identity Permissions
ar: تصاريح الهوية
de: Zugriff auf die Identität

# permissions.resource
source: Resource Permissions
ar: تصاريح المورد
de: Zugriff auf Ressourcen

# permissions.revoke
source: Revoke
ar: إلغاء
de: Zurücknehmen

# form.submit
source: Submit this form
ar: موافق
de: Daten übermitteln

# welcome.title
source: IdentityServer v3
ar: IdentityServer النسخة الثالثة

# welcome.header
source: Welcome to IdentityServer3
ar: مرحباً في IdentityServer3

# welcome.build
source: (build {version})
ar: (بناء {version})

# welcome.info1
source: IdentityServer publishes a <a href="{applicationPath}/.well-known/openid-configuration">discovery document</a> where you can find metadata and links to all the endpoints, key material, etc.
ar: يقوم IdentityServer بنشر <a href="{applicationPath}/.well-known/openid-configuration">مستند إكتشاف</a> يمكنك من خلاله إيجاد البيانات الوصفية و جميع روابط النقاط و المفاتيح.
de: IdentityServer veröffentlicht ein <a href="{applicationPath}/.well-known/openid-configuration">Discovery Dokument</a> mit Metadaten und Links zu Endpunkten etc.

# welcome.info2
source: IdentityServer allows users to view and revoke <a href="{applicationPath}/permissions">application permissions</a> previously granted to client applications.
ar: يُمَكِّن IdentityServer المستخدم من استعراض و حذف <a href="{applicationPath}/permissions">تصاريح التطبيقات</a> التي تم منحها سابقاً.
de: IdentityServer erlaubt es Benutzern bereits vergebene <a href="{applicationPath}/permissions">Berechtigungen</a> anzusehen und zurück zu nehmen.

# welcome.info3
source: Here are links to the <a href="https://identityserver.github.io/Documentation">documentation</a>, and <a href="https://github.com/identityserver/Thinktecture.IdentityServer3.Samples">ready to use samples</a>.
ar: هنا تجد روابط ل<a href="https://identityserver.github.io/Documentation">التوثيق</a> و <a href="https://github.com/identityserver/Thinktecture.IdentityServer3.Samples">بعض النماذج الجاهزة للإستخدام</a>
de: Hier sind die Link zu <a href="https://identityserver.github.io/Documentation">Dokumentation</a>, und <a href="https://github.com/identityserver/IdentityServer3.Samples">anwendbare Beispiele</a>.
